Stimaleger/STM32LoraWanProject/LoRaWAN/App/lora_app.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    lora_app.c
 * @author  MCD Application Team
 * @brief   Application of the LRWAN Middleware
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "platform.h"
#include "sys_app.h"
#include "lora_app.h"
#include "stm32_seq.h"
#include "stm32_timer.h"
#include "utilities_def.h"
#include "app_version.h"
#include "lorawan_version.h"
#include "subghz_phy_version.h"
#include "lora_info.h"
#include "LmHandler.h"

/* USER CODE BEGIN Includes */
#include "pms5003.h"
/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/
/**
 * @brief LoRa State Machine states
 */
typedef enum TxEventType_e
{
    /**
     * @brief Appdata Transmission issue based on timer every TxDutyCycleTime
     */
    TX_ON_TIMER,
    /**
     * @brief Appdata Transmission external event plugged on OnSendEvent( )
     */
    TX_ON_EVENT
/* USER CODE BEGIN TxEventType_t */

/* USER CODE END TxEventType_t */
} TxEventType_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/**
 * LEDs period value of the timer in ms
 */
#define LED_PERIOD_TIME 500

/**
 * Join switch period value of the timer in ms
 */
#define JOIN_TIME 2000

/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
/**
 * @brief  LoRa End Node send request
 */
static void SendTxData(void);

/**
 * @brief  TX timer callback function
 * @param  context ptr of timer context
 */
static void OnTxTimerEvent(void *context);

/**
 * @brief  join event callback function
 * @param  joinParams status of join
 */
static void OnJoinRequest(LmHandlerJoinParams_t *joinParams);

/**
 * @brief callback when LoRaWAN application has sent a frame
 * @brief  tx event callback function
 * @param  params status of last Tx
 */
static void OnTxData(LmHandlerTxParams_t *params);

/**
 * @brief callback when LoRaWAN application has received a frame
 * @param appData data received in the last Rx
 * @param params status of last Rx
 */
static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params);

/**
 * @brief callback when LoRaWAN Beacon status is updated
 * @param params status of Last Beacon
 */
static void OnBeaconStatusChange(LmHandlerBeaconParams_t *params);

/**
 * @brief callback when system time has been updated
 */
static void OnSysTimeUpdate(void);

/**
 * @brief callback when LoRaWAN application Class is changed
 * @param deviceClass new class
 */
static void OnClassChange(DeviceClass_t deviceClass);

/**
 * @brief  stop current LoRa execution to switch into non default Activation mode
 */
static void StopJoin(void);

/**
 * @brief  Join switch timer callback function
 * @param  context ptr of Join switch context
 */
static void OnStopJoinTimerEvent(void *context);

/**
 * @brief  Notifies the upper layer that the NVM context has changed
 * @param  state Indicates if we are storing (true) or restoring (false) the NVM context
 */
static void OnNvmDataChange(LmHandlerNvmContextStates_t state);

/**
 * Will be called each time a Radio IRQ is handled by the MAC layer
 *
 */
static void OnMacProcessNotify(void);

/**
 * @brief Change the periodicity of the uplink frames
 * @param periodicity uplink frames period in ms
 * @note Compliance test protocol callbacks
 */
static void OnTxPeriodicityChanged(uint32_t periodicity);

/**
 * @brief Change the confirmation control of the uplink frames
 * @param isTxConfirmed Indicates if the uplink requires an acknowledgement
 * @note Compliance test protocol callbacks
 */
static void OnTxFrameCtrlChanged(LmHandlerMsgTypes_t isTxConfirmed);

/**
 * @brief Change the periodicity of the ping slot frames
 * @param pingSlotPeriodicity ping slot frames period in ms
 * @note Compliance test protocol callbacks
 */
static void OnPingSlotPeriodicityChanged(uint8_t pingSlotPeriodicity);

/**
 * @brief Will be called to reset the system
 * @note Compliance test protocol callbacks
 */
static void OnSystemReset(void);

/* USER CODE BEGIN PFP */

/**
 * @brief  LED Tx timer callback function
 * @param  context ptr of LED context
 */
static void OnTxTimerLedEvent(void *context);

/**
 * @brief  LED Rx timer callback function
 * @param  context ptr of LED context
 */
static void OnRxTimerLedEvent(void *context);

/**
 * @brief  LED Join timer callback function
 * @param  context ptr of LED context
 */
static void OnJoinTimerLedEvent(void *context);

/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
/**
 * @brief LoRaWAN default activation type
 */
static ActivationType_t ActivationType = ACTIVATION_TYPE_OTAA;

/**
 * @brief LoRaWAN force rejoin even if the NVM context is restored
 */
static bool ForceRejoin = true;

/**
 * @brief LoRaWAN handler Callbacks
 */
static LmHandlerCallbacks_t LmHandlerCallbacks =
{ .GetBatteryLevel = GetBatteryLevel, .GetTemperature = GetTemperatureLevel,
        .GetUniqueId = GetUniqueId, .GetDevAddr = GetDevAddr, .OnMacProcess =
                OnMacProcessNotify, .OnNvmDataChange = OnNvmDataChange,
        .OnJoinRequest = OnJoinRequest, .OnTxData = OnTxData, .OnRxData =
                OnRxData, .OnBeaconStatusChange = OnBeaconStatusChange,
        .OnSysTimeUpdate = OnSysTimeUpdate, .OnClassChange = OnClassChange,
        .OnTxPeriodicityChanged = OnTxPeriodicityChanged,
        .OnTxFrameCtrlChanged = OnTxFrameCtrlChanged,
        .OnPingSlotPeriodicityChanged = OnPingSlotPeriodicityChanged,
        .OnSystemReset = OnSystemReset, };

/**
 * @brief LoRaWAN handler parameters
 */
static LmHandlerParams_t LmHandlerParams =
{ .ActiveRegion = ACTIVE_REGION, .DefaultClass = LORAWAN_DEFAULT_CLASS,
        .AdrEnable = LORAWAN_ADR_STATE, .IsTxConfirmed =
                LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, .TxDatarate =
                LORAWAN_DEFAULT_DATA_RATE, .TxPower = LORAWAN_DEFAULT_TX_POWER,
        .PingSlotPeriodicity = LORAWAN_DEFAULT_PING_SLOT_PERIODICITY,
        .RxBCTimeout = LORAWAN_DEFAULT_CLASS_B_C_RESP_TIMEOUT };

/**
 * @brief Type of Event to generate application Tx
 */
static TxEventType_t EventType = TX_ON_TIMER;

/**
 * @brief Timer to handle the application Tx
 */
static UTIL_TIMER_Object_t TxTimer;

/**
 * @brief Tx Timer period
 */
static UTIL_TIMER_Time_t TxPeriodicity = 120000;

/**
 * @brief Join Timer period
 */
static UTIL_TIMER_Object_t StopJoinTimer;

/* USER CODE BEGIN PV */
/**
 * @brief Specifies the state of the application LED
 */
static uint8_t AppLedStateOn = RESET;

/**
 * @brief Timer to handle the application Tx Led to toggle
 */
static UTIL_TIMER_Object_t TxLedTimer;

/**
 * @brief Timer to handle the application Rx Led to toggle
 */
static UTIL_TIMER_Object_t RxLedTimer;

/**
 * @brief Timer to handle the application Join Led to toggle
 */
static UTIL_TIMER_Object_t JoinLedTimer;

/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
/* USER CODE BEGIN EF */

/* USER CODE END EF */

void LoRaWAN_Init(void)
{
    /* USER CODE BEGIN LoRaWAN_Init_LV */
    /* USER CODE END LoRaWAN_Init_LV */

    /* USER CODE BEGIN LoRaWAN_Init_1 */

    APP_LOG(TS_OFF, VLEVEL_ALWAYS, "Initializing lorawan app !\r\n")

    /* Get LoRaWAN APP version*/
    UTIL_TIMER_Create(&TxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT,
            OnTxTimerLedEvent, NULL);
    UTIL_TIMER_Create(&RxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT,
            OnRxTimerLedEvent, NULL);
    UTIL_TIMER_Create(&JoinLedTimer, LED_PERIOD_TIME, UTIL_TIMER_PERIODIC,
            OnJoinTimerLedEvent, NULL);

    /* USER CODE END LoRaWAN_Init_1 */

    UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT,
            OnStopJoinTimerEvent, NULL);

    UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU,
            LmHandlerProcess);

    UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
            UTIL_SEQ_RFU, SendTxData);
    UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU,
            StopJoin);

    /* Init Info table used by LmHandler*/
    LoraInfo_Init();

    /* Init the Lora Stack*/
    LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

    LmHandlerConfigure(&LmHandlerParams);

    /* USER CODE BEGIN LoRaWAN_Init_2 */
    UTIL_TIMER_Start(&JoinLedTimer);

    /* USER CODE END LoRaWAN_Init_2 */

    LmHandlerJoin(ActivationType, ForceRejoin);

    if (EventType == TX_ON_TIMER)
    {
        /* send every time timer elapses */
        UTIL_TIMER_Create(&TxTimer, TxPeriodicity, UTIL_TIMER_ONESHOT,
                OnTxTimerEvent, NULL);
        UTIL_TIMER_Start(&TxTimer);
    }
    else
    {
        /* USER CODE BEGIN LoRaWAN_Init_3 */

        /* USER CODE END LoRaWAN_Init_3 */
    }

    /* USER CODE BEGIN LoRaWAN_Init_Last */

    /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
            CFG_SEQ_Prio_0);
}
/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
    /* USER CODE BEGIN OnRxData_1 */

    if (params != NULL)
    {
        HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET); /* LED_BLUE */

        UTIL_TIMER_Start(&RxLedTimer);

        if (params->IsMcpsIndication)
        {
            if (appData != NULL)
            {
                if (appData->Buffer != NULL)
                {
                    switch (appData->Port)
                    {
                    case LORAWAN_SWITCH_CLASS_PORT:
                        /*this port switches the class*/
                        if (appData->BufferSize == 1)
                        {
                            switch (appData->Buffer[0])
                            {
                            case 0:
                            {
                                LmHandlerRequestClass(CLASS_A);
                                break;
                            }
                            case 1:
                            {
                                LmHandlerRequestClass(CLASS_B);
                                break;
                            }
                            case 2:
                            {
                                LmHandlerRequestClass(CLASS_C);
                                break;
                            }
                            default:
                                break;
                            }
                        }
                        break;
                    case LORAWAN_USER_APP_PORT:
                        if (appData->BufferSize == 1)
                        {
                            AppLedStateOn = appData->Buffer[0] & 0x01;
                            if (AppLedStateOn == RESET)
                            {
                                APP_LOG(TS_OFF, VLEVEL_H, "LED OFF\r\n");
                                HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin,
                                        GPIO_PIN_RESET); /* LED_RED */
                            }
                            else
                            {
                                APP_LOG(TS_OFF, VLEVEL_H, "LED ON\r\n");
                                HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin,
                                        GPIO_PIN_SET); /* LED_RED */
                            }
                        }
                        break;

                    default:

                        break;
                    }
                }
            }
        }
        if (params->RxSlot < RX_SLOT_NONE)
        {
        }
    }
    /* USER CODE END OnRxData_1 */
}

static void SendTxData(void)
{
    /* USER CODE BEGIN SendTxData_1 */
    struct PMS5003Data data = {0};
    LmHandlerAppData_t lmData;

    if (LmHandlerJoinStatus() == LORAMAC_HANDLER_SET)
    {
        if (PMS5003_Read(&data) == 0)
        {
            APP_LOG(TS_OFF, VLEVEL_ALWAYS, ""
                    "Read data from PMS5003:\r\n"
                    "\tdata.pm1_0_atm: %d\r\n"
                    "\tdata.pm2_5_atm: %d\r\n"
                    "\tdata.pm_10_atm: %d\r\n"
                    "\tdata.nbParticles0_3um: %d\r\n"
                    "\tdata.nbParticles0_3um: %d\r\n"
                    "\tdata.nbParticles0_5um: %d\r\n"
                    "\tdata.nbParticles1_0um: %d\r\n"
                    "\tdata.nbParticles2_5um: %d\r\n"
                    "\tdata.nbParticles5_0um: %d\r\n"
                    "\tdata.nbParticles10um: %d\r\n",
                    data.pm1_0_atm, data.pm2_5_atm, data.pm_10_atm, data.nbParticles0_3um,
                    data.nbParticles0_5um, data.nbParticles1_0um, data.nbParticles2_5um,
                    data.nbParticles5_0um, data.nbParticles10um)
            lmData.Buffer = (uint8_t*) &data;
            lmData.BufferSize = sizeof(struct PMS5003Data);
            lmData.Port = 2;
            LmHandlerSend(&lmData, LORAMAC_HANDLER_UNCONFIRMED_MSG, false);
        }
    }
    /* USER CODE END SendTxData_1 */
}

static void OnTxTimerEvent(void *context)
{
    /* USER CODE BEGIN OnTxTimerEvent_1 */

    /* USER CODE END OnTxTimerEvent_1 */
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
            CFG_SEQ_Prio_0);

    /*Wait for next tx slot*/
    UTIL_TIMER_Start(&TxTimer);
    /* USER CODE BEGIN OnTxTimerEvent_2 */

    /* USER CODE END OnTxTimerEvent_2 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static void OnTxTimerLedEvent(void *context)
{
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
    HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

/* USER CODE END PrFD_LedEvents */

static void OnTxData(LmHandlerTxParams_t *params)
{
    /* USER CODE BEGIN OnTxData_1 */
    if ((params != NULL))
    {
        /* Process Tx event only if its a mcps response to prevent some internal events (mlme) */
        if (params->IsMcpsConfirm != 0)
        {
            HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET); /* LED_GREEN */
            UTIL_TIMER_Start(&TxLedTimer);

            APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Confirm =============\r\n"); APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d", params->UplinkCounter,
                    params->AppData.Port, params->Datarate, params->TxPower);

            APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
            if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG)
            {
                APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n", (params->AckReceived != 0) ? "ACK" : "NACK");
            }
            else
            {
                APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
            }
        }
    }
    /* USER CODE END OnTxData_1 */
}

static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
    /* USER CODE BEGIN OnJoinRequest_1 */
    if (joinParams != NULL)
    {
        if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
        {
            UTIL_TIMER_Stop(&JoinLedTimer);
            HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */

            APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
            if (joinParams->Mode == ACTIVATION_TYPE_ABP)
            {
                APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
            }
            else
            {
                APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
            }
        }
        else
        {
            APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
        }

        APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:JOIN | DR:%d | PWR:%d\r\n", joinParams->Datarate, joinParams->TxPower);
    }
    /* USER CODE END OnJoinRequest_1 */
}

static void OnBeaconStatusChange(LmHandlerBeaconParams_t *params)
{
    /* USER CODE BEGIN OnBeaconStatusChange_1 */
    if (params != NULL)
    {
        switch (params->State)
        {
        default:
        case LORAMAC_HANDLER_BEACON_LOST:
        {
            APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### BEACON LOST\r\n");
            break;
        }
        case LORAMAC_HANDLER_BEACON_RX:
        {
            APP_LOG(TS_OFF, VLEVEL_M,
                    "\r\n###### BEACON RECEIVED | DR:%d | RSSI:%d | SNR:%d | FQ:%d | TIME:%d | DESC:%d | "
                    "INFO:02X%02X%02X %02X%02X%02X\r\n",
                    params->Info.Datarate, params->Info.Rssi, params->Info.Snr, params->Info.Frequency,
                    params->Info.Time.Seconds, params->Info.GwSpecific.InfoDesc,
                    params->Info.GwSpecific.Info[0], params->Info.GwSpecific.Info[1],
                    params->Info.GwSpecific.Info[2], params->Info.GwSpecific.Info[3],
                    params->Info.GwSpecific.Info[4], params->Info.GwSpecific.Info[5]);
            break;
        }
        case LORAMAC_HANDLER_BEACON_NRX:
        {
            APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### BEACON NOT RECEIVED\r\n");
            break;
        }
        }
    }
    /* USER CODE END OnBeaconStatusChange_1 */
}

static void OnSysTimeUpdate(void)
{
    /* USER CODE BEGIN OnSysTimeUpdate_1 */

    /* USER CODE END OnSysTimeUpdate_1 */
}

static void OnClassChange(DeviceClass_t deviceClass)
{
    /* USER CODE BEGIN OnClassChange_1 */
    APP_LOG(TS_OFF, VLEVEL_M, "Switch to Class %c done\r\n", "ABC"[deviceClass]);
    /* USER CODE END OnClassChange_1 */
}

static void OnMacProcessNotify(void)
{
    /* USER CODE BEGIN OnMacProcessNotify_1 */

    /* USER CODE END OnMacProcessNotify_1 */
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);

    /* USER CODE BEGIN OnMacProcessNotify_2 */

    /* USER CODE END OnMacProcessNotify_2 */
}

static void OnTxPeriodicityChanged(uint32_t periodicity)
{
    /* USER CODE BEGIN OnTxPeriodicityChanged_1 */

    /* USER CODE END OnTxPeriodicityChanged_1 */
    TxPeriodicity = periodicity;

    if (TxPeriodicity == 0)
    {
        /* Revert to application default periodicity */
        TxPeriodicity = APP_TX_DUTYCYCLE;
    }

    /* Update timer periodicity */
    UTIL_TIMER_Stop(&TxTimer);
    UTIL_TIMER_SetPeriod(&TxTimer, TxPeriodicity);
    UTIL_TIMER_Start(&TxTimer);
    /* USER CODE BEGIN OnTxPeriodicityChanged_2 */

    /* USER CODE END OnTxPeriodicityChanged_2 */
}

static void OnTxFrameCtrlChanged(LmHandlerMsgTypes_t isTxConfirmed)
{
    /* USER CODE BEGIN OnTxFrameCtrlChanged_1 */

    /* USER CODE END OnTxFrameCtrlChanged_1 */
    LmHandlerParams.IsTxConfirmed = isTxConfirmed;
    /* USER CODE BEGIN OnTxFrameCtrlChanged_2 */

    /* USER CODE END OnTxFrameCtrlChanged_2 */
}

static void OnPingSlotPeriodicityChanged(uint8_t pingSlotPeriodicity)
{
    /* USER CODE BEGIN OnPingSlotPeriodicityChanged_1 */

    /* USER CODE END OnPingSlotPeriodicityChanged_1 */
    LmHandlerParams.PingSlotPeriodicity = pingSlotPeriodicity;
    /* USER CODE BEGIN OnPingSlotPeriodicityChanged_2 */

    /* USER CODE END OnPingSlotPeriodicityChanged_2 */
}

static void OnSystemReset(void)
{
    /* USER CODE BEGIN OnSystemReset_1 */

    /* USER CODE END OnSystemReset_1 */
    if ((LORAMAC_HANDLER_SUCCESS == LmHandlerHalt())
            && (LmHandlerJoinStatus() == LORAMAC_HANDLER_SET))
    {
        NVIC_SystemReset();
    }
    /* USER CODE BEGIN OnSystemReset_Last */

    /* USER CODE END OnSystemReset_Last */
}

static void StopJoin(void)
{
    /* USER CODE BEGIN StopJoin_1 */
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET); /* LED_BLUE */
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET); /* LED_GREEN */
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET); /* LED_RED */
    /* USER CODE END StopJoin_1 */

    UTIL_TIMER_Stop(&TxTimer);

    if (LORAMAC_HANDLER_SUCCESS != LmHandlerStop())
    {
        APP_LOG(TS_OFF, VLEVEL_M, "LmHandler Stop on going ...\r\n");
    }
    else
    {
        APP_LOG(TS_OFF, VLEVEL_M, "LmHandler Stopped\r\n");
        if (LORAWAN_DEFAULT_ACTIVATION_TYPE == ACTIVATION_TYPE_ABP)
        {
            ActivationType = ACTIVATION_TYPE_OTAA;
            APP_LOG(TS_OFF, VLEVEL_M, "LmHandler switch to OTAA mode\r\n");
        }
        else
        {
            ActivationType = ACTIVATION_TYPE_ABP;
            APP_LOG(TS_OFF, VLEVEL_M, "LmHandler switch to ABP mode\r\n");
        }
        LmHandlerConfigure(&LmHandlerParams);
        LmHandlerJoin(ActivationType, true);
        UTIL_TIMER_Start(&TxTimer);
    }
    UTIL_TIMER_Start(&StopJoinTimer);
    /* USER CODE BEGIN StopJoin_Last */

    /* USER CODE END StopJoin_Last */
}

static void OnStopJoinTimerEvent(void *context)
{
    /* USER CODE BEGIN OnStopJoinTimerEvent_1 */

    /* USER CODE END OnStopJoinTimerEvent_1 */
    if (ActivationType == LORAWAN_DEFAULT_ACTIVATION_TYPE)
    {
        UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), CFG_SEQ_Prio_0);
    }
    /* USER CODE BEGIN OnStopJoinTimerEvent_Last */
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
    /* USER CODE END OnStopJoinTimerEvent_Last */
}

static void OnNvmDataChange(LmHandlerNvmContextStates_t state)
{
    /* USER CODE BEGIN OnNvmDataChange_1 */

    /* USER CODE END OnNvmDataChange_1 */
    /* USER CODE BEGIN OnNvmDataChange_Last */

    /* USER CODE END OnNvmDataChange_Last */
}
